import pandas as pd


soulbility_table = pd.DataFrame({
    'H(+)': list(' ' + 'Р' * 18 + 'Н'),
    'Li(+)': list('РМ' + 'Р' * 6 + '?' + 'Р' * 4 + 'Н?' + 'Р' * 4 + 'Н'),
    'K(+)': list('Р' * 20),
    'Na(+)': list('Р' * 20),
    'NH4(+)': list('Р' * 13 + '-' + 'Р' * 5 + '?'),
    'Ba(2+)': list('РМРРР-РНРН?РРННРНРРН'),
    'Ca(2+)': list('МНРРР-РНРМ?РРННРНРРН'),
    'Mg(2+)': list('ННРРР-РМРР?РРНМРНРРН'),
    'Sr(2+)': list('МНРРРНРНРН-РРННРНРРН'),
    'Al(3+)': list('НМРРР-???Р?Р?Н????-?'),
    'Cr(3+)': list('ННРР?-?-?Р?Р?Н????Р?'),
    'Fe(2+)': list('ННРРРН?Н?Р?Р?ННРНРРН'),
    'Fe(3+)': list('ННРР?-???Р?Р?Н??-?-?'),
    'Ni(2+)': list('НРРРРН?Н?Р?РРН??Н?Р?'),
    'Co(2+)': list('НРРРРННН?Р?РМН??Н?Р?'),
    'Mn(2+)': list('НРРРРН???Р?Р?ННРН?РН'),
    'Zn(2+)': list('НРРРРН?М?Р?Р?Н?РН?РН'),
    'Ag(+)': list('-РНННН?Н?М?РМН?РН?Р?'),
    'Hg(2+)': list('--РМНН?Н?-?Р?Н??Н?Р?'),
    'Pb(2+)': list('ННММНН?Н?ННР?НМ-НРРН'),
    'Sn(2+)': list('НРРРМН???Р?-?НН???-?'),
    'Cu(2+)': list('НРРР?Н???Р?Р?Н??Н?Р?')
}, index=['OH(-)', 'F(-)', 'Cl(-)', 'Br(-)', 'I(-)', 'S(2-)', 'HS(-)',
'SO3(2-)', 'HSO3(-)', 'SO4(2-)', 'HSO4(-)', 'NO3(-)', 'NO2(-)', 'PO4(3-)',
'HPO4(2-)', 'H2PO4(-)', 'CO3(2-)', 'HCO3(-)', 'CH3COO(-)', 'SiO3(2-)'])

soulbility_table.to_csv('sbtable.csv')